update caliper slave motor control implementation
